{
  "questIDHigh:4": 0,
  "preRequisites:9": {
    "0:10": {
      "questIDHigh:4": 0,
      "questIDLow:4": 50
    }
  },
  "questIDLow:4": 634,
  "properties:10": {
    "betterquesting:10": {
      "snd_complete:8": "random.levelup",
      "taskLogic:8": "AND",
      "partySingleReward:1": 0,
      "visibility:8": "NORMAL",
      "isMain:1": 0,
      "simultaneous:1": 0,
      "icon:10": {
        "id:8": "minecraft:written_book",
        "Count:3": 1,
        "tag:10": {
          "pages:9": {
            "0:8": "August 10, 21X1\n\nIt\u0027s been eight years since the fusion reactor began stable operation, and I no longer need to worry about running out of energy - Duck Egg has an inexhaustible supply of helium-3 that will last me at least 20,000 years.",
            "1:8": "But I won\u0027t live that long. I haven\u0027t forgotten my first and always wish: to return to Earth.\n",
            "2:8": "February 3, 21X2.\n\nI\u0027ve been researching the application of space-warp technology. Space-warp has allowed me to travel to neighboring planetary systems, but I still convern traveling to a place as far away as Earth - 68 light years away.",
            "3:8": "I understand that space-warp over great distances could cause permanent damage to me.\n",
            "4:8": "June 10, 21X2.\n\nSpring has passed again, and Terrafirma is starting to come alive, but I am becoming more and more depressed.\n",
            "5:8": "It wasn\u0027t until yesterday that I discovered a frightening fact: I have leukemia. I thought it was most likely the result of the continuing effects on me over the decades of the high-energy particles released by Duck Egg.\n",
            "6:8": "The incident was like a thunderbolt that forced me to contemplate my response. I don\u0027t have radiation protection or a cure for cancer. Even if I could develop it, I probably wouldn\u0027t make it through that time.\n",
            "7:8": "June 15, 21X2.\n\nI decided to take a risk. I forged the toughest alloy I could make - Infinity - into a protective suit. I hope that this will protect me from the damage of the hyper warp.\n",
            "8:8": "July 16, 21X2.\n\nWhoever is reading this diary, I want you to know that I\u0027m off. It has taken me a month to transport the items I need to carry on board the space station, yet the machinery left on the Terrafirma is still plentiful.\n",
            "9:8": "Earth\u0027s coordinates have been entered into the warp controller, and I push down the warp lever in my Infinity protective suit.\nBeginning the... the homeward journey."
          },
          "author:8": "亚历山大·史蒂夫·二世",
          "Count:1": 1,
          "id:2": 386,
          "title:8": "最后的日记",
          "Damage:2": 0
        },
        "Damage:2": 0,
        "OreDict:8": ""
      },
      "snd_update:8": "random.levelup",
      "repeatTime:3": -1,
      "globalShare:1": 0,
      "questLogic:8": "AND",
      "repeat_relative:1": 1,
      "name:8": "tfr.quest634.name",
      "lockedProgress:1": 0,
      "autoClaim:1": 0,
      "isSilent:1": 0,
      "desc:8": "tfr.quest634.desc"
    }
  },
  "tasks:9": {},
  "rewards:9": {}
}